WW = {'Å': 'A', 'Ä': 'A', 'å': 'a', 'ä': 'a', 'ã': 'a', 'á': 'a', 'à': 'a', 'â': 'a', 'ă': 'a', 'ą': 'a', 'ā': 'a',
          'Ö': 'O', 'Ø': 'O', 'ö': 'o', 'ø': 'o', 'ó': 'o', 'ô': 'o', 'è': 'e', 'ė': 'e', 'ë': 'e', 'é': 'e', 'ê': 'e',
          'É': 'E', 'í': 'i', 'î': 'i', 'ï': 'i', 'Ü': 'U', 'ü': 'u', 'ł': 'l', 'ñ': 'n', 'š': 's', 'Ş': 'S', 'ş': 's',
          'ß': 'ss', 'Ç': 'C', 'ç': 'c', 'ć': 'c', 'ğ': 'g', 'ž': 'z', 'Ž': 'Z', 'Š': 'S', 'ő': 'o', 'ú': 'u',
          'Æ': 'AE', 'æ': 'ae', '—': '-', '®': '', '™': '', '|': '', '•': '', '*': '', '★': ''}

DACH = {'Å': 'A', 'Ä': 'Ae', 'å': 'a', 'ä': 'ae', 'ã': 'a', 'á': 'a', 'à': 'a', 'â': 'a', 'ă': 'a', 'ą': 'a',
          'ā': 'a', 'Ö': 'Oe', 'Ø': 'O', 'ö': 'oe', 'ø': 'o', 'ó': 'o', 'ô': 'o', 'è': 'e', 'ė': 'e', 'ë': 'ee',
          'é': 'e', 'ê': 'e', 'É': 'E', 'í': 'i', 'î': 'i', 'ï': 'i', 'Ü': 'Ue', 'ü': 'ue', 'ł': 'l', 'ñ': 'n',
          'š': 's', 'Ş': 'S', 'ş': 's', 'ß': 'ss', 'Ç': 'C', 'ç': 'c', 'ć': 'c', 'ğ': 'g', 'ž': 'z', 'Ž': 'Z', 'Š': 'S',
          'ő': 'o', 'ú': 'u', 'Æ': 'AE', 'æ': 'ae', '—': '-', '®': '', '™': '', '|': '', '•': '', '*': '', '★': ''}


def sym_to_ascii(cell, region):
    changed = 0
    for sym, val in region.items():
        if sym in cell:
            cell = cell.replace(sym, val)
            changed += 1
    return cell, changed
